Revit 2027 API
IFCTransaction Constructor
 Instantiates a transaction object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCTransaction(
	IFCFile file
)
Public Sub New (
	file As IFCFile
)
public:
IFCTransaction(
	IFCFile^ file
)
new :
        file : IFCFile -> IFCTransaction
Parameters
file IFCFile
 The IFC file for which this transaction is going to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The transaction starts by creating a transaction object.
See Also
Reference
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace